Revit 2027 API
FamilyInstance.HandOrientation Property
Property to get the orientation of family instance hand.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ HandOrientation { get; }
Public ReadOnly Property HandOrientation As XYZ
	Get
public:
property XYZ^ HandOrientation {
	XYZ^ get ();
}
member HandOrientation : XYZ with get
Property Value
XYZ
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace